jrr30/STM32F44_Digital_Clock/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SET_BUTTON_Pin GPIO_PIN_13
#define SET_BUTTON_GPIO_Port GPIOC
#define BUZZER_OUT_Pin GPIO_PIN_5
#define BUZZER_OUT_GPIO_Port GPIOA
#define DATA_D4_Pin GPIO_PIN_5
#define DATA_D4_GPIO_Port GPIOC
#define DATA_D5_Pin GPIO_PIN_6
#define DATA_D5_GPIO_Port GPIOC
#define DECREMENT_BUTTON_Pin GPIO_PIN_7
#define DECREMENT_BUTTON_GPIO_Port GPIOC
#define DATA_D6_Pin GPIO_PIN_8
#define DATA_D6_GPIO_Port GPIOC
#define DATA_D7_Pin GPIO_PIN_9
#define DATA_D7_GPIO_Port GPIOC
#define SET_ALARM_BUTTON_Pin GPIO_PIN_11
#define SET_ALARM_BUTTON_GPIO_Port GPIOC
#define INCREMENT_BUTTON_Pin GPIO_PIN_12
#define INCREMENT_BUTTON_GPIO_Port GPIOC
#define RS_Pin GPIO_PIN_6
#define RS_GPIO_Port GPIOB
#define ENABLE_Pin GPIO_PIN_8
#define ENABLE_GPIO_Port GPIOB
#define RW_Pin GPIO_PIN_9
#define RW_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
